emacs2/.emacs.d/Emacs.org
#+TITLE:  config
#+AUTHOR: Felix Dumbeck
#+STARTUP: fold
#+PROPERTY: header-args :emacs-lisp :tangle ./init.el :results silent :mkdirp yes
#+auto_tangle: t

* measure startup performance (disabled)
in order to measure the time it takes for Emacs to startup use ~emacs-init-time~
see what packages are loaded at startup (*only have it enabled when debugging!*):

** show which packages were loaded
#+begin_src emacs-lisp :tangle no
  (setq use-package-compute-statistics t)
  (setq debug-on-error t)
  (setq use-package-verbose t)
  ;;(with-eval-after-load 'org
  ;;(debug))
  ;; Measure startup time
#+end_src

** display startup time
#+begin_src emacs-lisp :tangle no
  (defun my/display-startup-time ()
    "Display the startup time after Emacs initialization."
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))
  (add-hook 'emacs-startup-hook #'my/display-startup-time)
#+end_src

** profiling
#+begin_src emacs-lisp :tangle no
  ;; Add to beginning of init.el for profiling
  (require 'profiler)
  (profiler-start 'cpu)

  ;; Add to end of init.el
  (profiler-stop)
  (profiler-report)
#+end_src

** Benchmark Individual Packages
#+begin_src emacs-lisp
  (defmacro my/time-it (name &rest body)
    "Measure execution time of BODY and display with NAME."
    `(let ((time (current-time)))
       ,@body
       (message "%s: %.06f seconds" ,name
                (float-time (time-since time)))))
#+end_src

#+begin_src emacs-lisp :tangle no
  ;; Usage example
  (my/time-it "Loading Magit"
  	    (use-package magit
  	      :defer t
  	      :bind ("C-x g" . magit-status)))
#+end_src

** Enable Configuration Warnings
#+begin_src emacs-lisp :tangle no
  ;; Enable debug mode for configuration errors
  (setq debug-on-error t)
  (setq warning-minimum-level :error)

  ;; Log package loading issues
  (setq use-package-verbose t)
  (setq use-package-debug t)
#+end_src

** Idle time loading
#+begin_src emacs-lisp :tangle no
  ;; Load packages after Emacs has been idle
  (use-package dashboard
    :defer 2  ; Load after 2 seconds of idle time
    :config
    (dashboard-setup-startup-hook))

  (use-package all-the-icons
    :defer 5  ; Load after 5 seconds of idle time
    :if (display-graphic-p))
#+end_src

* load scame
#+begin_src emacs-lisp
  (load "~/scame/base.el" nil t)
  ;; (load "~/Documents/scame/extended/org-mode.el" nil t)
  ;; (load "~/Documents/scame/extended/editing-config.el" nil t)
  ;; (load "~/Documents/scame/extended/multiple-cursors.el" nil t)
  ;; (load "~/Documents/scame/extended/spell-check.el" nil t)
  ;; (load "~/Documents/scame/extended/dired-setting.el" nil t)
  ;; (load "~/Documents/scame/extended/mode-line.el" nil t)
  ;; (load "~/Documents/scame/extended/git.el" nil t)
  ;; (load "~/Documents/scame/extended/buffer-completion-system.el" nil t)
  ;; (load "~/Documents/scame/extended/minibuffer-completion-system.el" nil t)
  ;; (load "~/Documents/scame/extended/more-packages.el" nil t)
  (load "~/scame/extended.el" nil t)
#+end_src

* looks
#+begin_src emacs-lisp
  (when (display-graphic-p)
    ;; (set-frame-font "Comic Shanns Mono 14" nil t)
    (set-frame-font "Comic Code Ligatures 13" nil t)
    ;;(setq-default line-spacing 0.08)
    (load-theme 'modus-operandi-tinted)
    ;; (use-package ef-themes)
    ;; (use-package doric-themes)
    ;; (load-theme 'modus-operandi-tinted)
    ;; (load-theme 'modus-operandi-tinted)
    ;; (load-theme 'doric-wind)
    ;; (load-theme 'doric-earth)
    ;; (load-theme 'doric-oak)
    ;; (load-theme 'doric-light)
    ;; (load-theme 'doric-beach)
    ;; (load-theme 'doric-cherry)
    ;; (load-theme 'alect-light-alt)
    ;; (load-theme 'alect-black)
    ;; (load-theme 'doric-marble) ;obsidian
    ;; (load-theme 'ef-autumn)
    ;; (load-theme 'ef-fire)
    )
  ;; (set-face-attribute hl-line-face nil :underline t)
#+end_src
** more color stuff
#+begin_src emacs-lisp :tangle no
  (set-face-attribute hl-line-face nil :underline nil)
  (use-package gnome-accent-theme-switcher
    :demand t
    :vc (:url "https://github.com/protesilaos/gnome-accent-theme-switcher.git"
  	    :rev :newest)
    :bind
    (("<f5>" . gnome-accent-theme-switcher-toggle-mode)
     ("C-<f5>" . gnome-accent-theme-switcher-change-accent))
    :config
    (gnome-accent-theme-switcher-mode 1))
#+end_src
#+begin_src emacs-lisp :tangle no
  (use-package standard-themes
    :ensure t
    :init
    ;; This makes the Modus commands listed below consider only the
    ;; Standard themes.  For an alternative that includes Modus and all
    ;; derivative themes (like Standard), enable the
    ;; `modus-themes-include-derivatives-mode' instead.
    (standard-themes-take-over-modus-themes-mode 1)
    :bind
    (("<f5>" . modus-themes-rotate)
     ("C-<f5>" . modus-themes-select)
     ("M-<f5>" . modus-themes-load-random))
    :config
    ;; All customisations here.
    (setq modus-themes-mixed-fonts t)
    (setq modus-themes-italic-constructs t)

    ;; Finally, load your theme of choice (or a random one with
    ;; `modus-themes-load-random', `modus-themes-load-random-dark',
    ;; `modus-themes-load-random-light').
    (modus-themes-load-theme 'standard-light-tinted))
#+end_src
** modus theme modifications
for emacs 30:
#+begin_src emacs-lisp :tangle no
  (setq modus-themes-common-palette-overrides
        '((border-mode-line-active unspecified)
          (border-mode-line-inactive unspecified)))
#+end_src

#+begin_src emacs-lisp
  (setq modus-themes-fringes nil)
  (add-hook 'enable-theme-functions
            (lambda (&rest _) (set-face-foreground
                               'vertical-border (face-background 'default))))
#+end_src
* user specific
#+begin_src emacs-lisp
  ;; user info
  (setq user-full-name "Felix Dumbeck"
        user-mail-address "felix@dumbeck.net")

  (setq org-agenda-files
        '("~/uni/notes/uni.org"
          "~/uni/notes/personal.org"))
#+end_src
* org
#+begin_src emacs-lisp
  (setq org-export-in-background t)
#+end_src
** latex
*** bibliography
#+begin_src emacs-lisp
  ;; (setq org-highlight-latex-and-related '(latex script entities))
  (with-eval-after-load 'org
    (setq org-cite-global-bibliography '("~/Zotero/better-bibtex/My Library.bib")))

  ;; (setq org-cite-export-processors '((latex biblatex)))
  ;; (setq org-latex-pdf-process
  ;;     '("latexmk -pdf -interaction=nonstopmode -output-directory=%o %f"))
#+end_src
** org-roam
#+begin_src emacs-lisp
  (setq completion-in-region-function #'completion--in-region)
  (use-package org-roam
    :custom
    (org-roam-directory (file-truename "~/Documents/Notes"))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n g" . org-roam-graph)
           ("C-c n i" . org-roam-node-insert)
           ("C-c n c" . org-roam-capture)
  	 ("C-c n a" . org-roam-alias-add)
  	 ("C-c n b" . orb-insert-link)
           ;; Dailies
           ("C-c n j" . org-roam-dailies-capture-today))
    :config
    ;; If you're using a vertical completion framework, you might want a more informative completion interface
    (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    (org-roam-db-autosync-mode))
  (use-package org-roam-ui)
#+end_src
** org-roam-bibtex
#+begin_src emacs-lisp
  (use-package org-roam-bibtex
  :after org-roam
  :config
  (setq bibtex-completion-bibliography org-cite-global-bibliography)
  (setq orb-roam-ref-format 'org-cite)
  (org-roam-bibtex-mode))
#+end_src
* emacs-everywhere
#+begin_src emacs-lisp :tangle no
  (use-package emacs-everywhere
    :ensure t)
#+end_src

* lsp-mode
#+begin_src emacs-lisp :tangle no
  (use-package lsp-mode
    :init
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-=")
    :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
           ;; (java-ts-mode . lsp)
           ;; if you want which-key integration
           (lsp-mode . lsp-enable-which-key-integration))
    :commands lsp)

  ;; optionally
  (use-package lsp-ui :commands lsp-ui-mode)

  ;; optionally if you want to use debugger
  ;; (use-package dap-mode)
  ;; (use-package dap-LANGUAGE) to load the dap adapter for your language

  ;; (use-package lsp-java)

#+end_src
* show weather in modeline
#+begin_src emacs-lisp :tangle no
  (use-package display-wttr
    ;; :custom
    ;; (display-wttr-format "4")
    ;; (display-wttr-locations '(""))
    ;; (display-wttr-interval (* 60 60))
    :config
    (display-wttr-mode))
#+end_src
* elf-feed
subscribe to rss-feeds
#+begin_src emacs-lisp
  (use-package elfeed
    :bind ("C-x w" . elfeed)
    :config
    (setq elfeed-feeds
          '("http://nullprogram.com/feed/"
  	  "https://grapheneos.org/releases.atom"
  	  "https://mjg59.dreamwidth.org/data/rss"
  	  "https://nixos.org/blog/announcements-rss.xml"
  	  "https://rosenzweig.io/feed.xml"
  	  ;; "https://www.schneier.com/feed/atom/"
  	  "https://systemcrafters.net/rss/"
  	  "http://www.polyomica.com/feed/"
            "https://mccd.space/feed.xml"
            "https://dthompson.us/feed.xml"
  	  "https://smallcultfollowing.com/babysteps//atom.xml"
            ;; "https://planet.emacslife.com/atom.xml"
  	  "https://guix.gnu.org/feeds/blog.atom"
  	  "https://chrismaiorana.com/feed/"
  	  "https://blog.hansenpartnership.com/feed/"
            "https://news.opensuse.org/feed.xml"
            "https://irreal.org/blog/?feed=rss2"
            "https://protesilaos.com/keeb.xml"
            "https://protesilaos.com/codelog.xml"
            "https://protesilaos.com/news.xml"
            "https://drewdevault.com/blog/index.xml"
            "http://dominique.leuenberger.net/blog/feed"
            "https://lorendb.dev/index.xml"
            "https://0pointer.net/blog/index.rss20"
            "https://robert.kra.hn/feed.xml"
            "https://lambdaland.org/index.xml"
  	  "https://cjohansen.no/atom.xml"
            ;; "https://archlinux.org/feeds/news/"
            "https://blogs.kde.org/index.xml")))
#+end_src
* bindings
** open switch-to-buffer with =C-x C-b=
=C-x C-b= same as =C-x b= because that's what i always want
#+begin_src emacs-lisp :tangle no
  (bind-key "C-x C-b" #'switch-to-buffer)
#+end_src
** compile-mode
#+begin_src emacs-lisp
  (bind-key "C-c c c" #'compile)
  (bind-key "C-c c r" #'recompile)
#+end_src
** yank (paste) when pressing C-z
because it is very confusing when switching between qwerty and qwertz and the window gets minimized
#+begin_src emacs-lisp
  (bind-key "C-z" #'yank)
#+end_src
* langauge specific
** gleam
#+begin_src emacs-lisp
  (use-package gleam-ts-mode
    :mode ("\\.gleam\\'" . gleam-ts-mode)
    :config
    (with-eval-after-load 'eglot
      (add-to-list 'eglot-server-programs
    		 '(gleam-ts-mode . ("gleam" "lsp")))))
#+end_src
** nix-ts-mode
#+begin_src emacs-lisp
  (use-package nix-ts-mode
    :mode ("\\.nix\\'" . nix-ts-mode))
#+end_src
** java
#+begin_src emacs-lisp
  (use-package eglot-java
    :defer t)
#+end_src
** python
#+begin_src emacs-lisp
  (use-package indent-bars
    :hook (python-ts-mode . indent-bars-mode))
#+end_src
** rust
*** rust-mode
#+begin_src emacs-lisp :tangle no
  (use-package rust-mode
    :init (setq rust-mode-treesitter-derive t)
    :mode ("\\.rs\\'" . rust-mode)
    :config
    (add-hook 'rust-mode-hook 'eglot-ensure))
#+end_src
*** rust-ts-mode get info regarding indentation from rustfmt.toml
#+begin_src emacs-lisp
  ;;;###autoload
  (defun felix/rust-ts--apply-rustfmt-config (rustfmt-data)
    "Apply settings from RUSTFMT-DATA to the current buffer.
    RUSTFMT-DATA is an alist parsed from rustfmt.toml."
    (let ((hard-tabs (alist-get "hard_tabs" rustfmt-data nil nil #'equal))
          (tab-spaces (alist-get "tab_spaces" rustfmt-data nil nil #'equal)))
      (message "rustfmt config: hard_tabs: %s; tab_spaces: %s" hard-tabs tab-spaces)
      (when (eq hard-tabs t)
        (setq-local indent-tabs-mode t))
      (if tab-spaces
          (setq-local tab-width tab-spaces)
        (setq-local tab-width 4))))
  ;;;###autoload
  (defun felix/rust-ts--find-and-apply-rustfmt-config ()
    (interactive)
    "Look for a rustfmt.toml file in the current project tree and apply its settings."
    (let ((root (locate-dominating-file default-directory "rustfmt.toml")))
      (if (not(eql root nil))
    	(let ((rustfmt-file (expand-file-name "rustfmt.toml" root)))
    	  (message "using rustfmt.toml file: %s" rustfmt-file)
    	  (use-package toml)
    	  (condition-case err
    	      (let ((data (toml:read-from-file rustfmt-file)))
    		(message "data: %s" data)
    		(felix/rust-ts--apply-rustfmt-config data))
    	    (error (message "error: %s" err))))
        (message "no rustfmt-file found"))))

  (add-hook 'rust-ts-mode-hook #'felix/rust-ts--find-and-apply-rustfmt-config)
#+end_src

* tramp remote path for nixos
#+begin_src emacs-lisp :tangle no
  (use-package tramp
    :config
    (setq tramp-remote-process-environment
  	(append
  	 (list (concat "PATH="
                         "/run/wrappers/bin" ":"
                         "/home/admin/.nix-profile/bin" ":"
                         "/nix/profile/bin" ":"
                         "/home/admin/.local/state/nix/profile/bin" ":"
                         "/etc/profiles/per-user/admin/bin" ":"
                         "/nix/var/nix/profiles/default/bin" ":"
                         "/run/current-system/sw/bin" ":"
                         "/bin" ":" "/usr/bin")) ; Match terminal PATH
  	 tramp-remote-process-environment)))
#+end_src
* llm
#+begin_src emacs-lisp
  (use-package gptel)
#+end_src
#+begin_src emacs-lisp :tangle no
  ;; OPTIONAL configuration
  (setq
   gptel-model 'mistral:latest
   gptel-backend (gptel-make-ollama "Ollama"
                   :host "localhost:11434"
                   :stream t
                   :models '(mistral:latest)))
#+end_src
* email
#+begin_src emacs-lisp
  (setq auth-sources '("secrets:default" default))

  ;; (use-package smtpmail)
  (setq message-send-mail-function 'smtpmail-send-it
        smtpmail-smtp-server "smtp.mailbox.org"
        smtpmail-smtp-service 465
        smtpmail-stream-type 'ssl
        smtpmail-smtp-user "felix@dumbeck.net")

  ;; (setq auth-nsource-debug t)
  ;; (setq smtpmail-debug-info t
  ;;       smtpmail-debug-verb t)
#+end_src

* look into:
+ [[https://github.com/konrad1977/flyover][GitHub - konrad1977/flyover: A beautiful inline overlay for Emacs (Flycheck |...]]
+ [[https://thanosapollo.org/posts/use-emacs-everywhere/][Emacs Everywhere, even in Wayland | Thanos Apollo]]
+ [[https://thanosapollo.org/posts/emacs-notmuch-video-guide/][(Video) Emacs Notmuch with Multiple Addresses & Auto Encryption | Thanos Apollo]]
+ [[https://gitlab.com/jabranham/system-packages][Alex Branham / system-packages · GitLab]]

